[
  {
    "id": 1,
    "img": "https://i.ibb.co/R7hJSHB/bistro-boss-home.png",
    "img1": "https://i.ibb.co/nPnwfqF/1.png",
    "img2": "https://i.ibb.co/WvNp75J/3.png",
    "img3": "https://i.ibb.co/27Zt1sv/4.png",
    "img4": "https://i.ibb.co/g45NR07/5.png",
    "img5": "https://i.ibb.co/Bc87K1Y/screencapture-bistro-boss-15cc7-web-app-dashboard-add-item-2023-08-10-21-54-07.png",
    "name": "Bistro Boss Restaurant",
    "description": "Bistro Boss Restaurant – an innovative management web app. Seamlessly featuring distinct dashboard routes for both admin and user roles, this app revolutionizes restaurant operations. With secure authentication, streamline reservations, orders, and menu management. Simplify staff coordination, enhance customer service, and empower eateries for success",
    "details": [
      {
        "step": "Bistro Boss Restaurant is an innovative management web app."
      },
      {
        "step": "Seamlessly featuring distinct dashboard routes for both admin and user roles, this app revolutionizes restaurant operations."
      },
      {
        "step": "With secure authentication, streamline reservations, orders, and menu management."
      }
    ],
    "githubClient": "https://github.com/KamrujjamanRony/bistro-boss-restaurant/",
    "link": "https://bistro-boss-15cc7.web.app/",
    "tools": [
      "React",
      "Redux",
      "TailwindCSS",
      "DaisyUI",
      "React Router",
      "Firebase",
      "React Firebase Hooks",
      "Node.js",
      "MongoDB",
      "Express",
      "Vite.js",
      "Stripe",
      "JWT token",
      "React paginate",
      "Axios",
      "React helmet",
      "React icons",
      "React Parallax",
      "React responsive carousel",
      "React simple captcha",
      "React tabs",
      "Sweetalert2",
      "Swiper.js",
      "Cors",
      "Dotenv"
    ]
  },
  {
    "id": 2,
    "img": "https://i.ibb.co/wK0859Q/3d-portfolio-home.png",
    "img1": "https://i.ibb.co/dJxVrvP/kamrujjaman-3d.png",
    "name": "3D Portfolio",
    "description": "A dynamic React-powered website merging 3D object models and stunning animations. Seamlessly navigate through sections like banner, about, experience, skills, projects, testimonials, and contact. A showcase of my frontend prowess, this project boasts interactive elements, responsive layout, and captivating animations, underscoring my skills in React, creative design, and user experience.",
    "details": [
      {
        "step": "A dynamic React-powered website merging 3D object models and stunning animations."
      },
      {
        "step": "Seamlessly navigate through sections like banner, about, experience, skills, projects, testimonials, and contact. "
      },
      {
        "step": "A showcase of my frontend prowess, this project boasts interactive elements, responsive layout, and captivating animations, underscoring my skills in React, creative design, and user experience."
      }
    ],
    "githubClient": "https://github.com/KamrujjamanRony/3d-portfolio",
    "link": "https://kamrujjaman-3d.netlify.app/",
    "tools": [
      "React",
      "TailwindCSS",
      "DaisyUI",
      "React Router",
      "Node.js",
      "React Vertical Timeline Component",
      "Three.js"
    ]
  },
  {
    "id": 3,
    "img": "https://i.ibb.co/ThfT3gv/sura-tour-home.png",
    "img1": "https://i.ibb.co/xmvfqf1/sura-tour.png",
    "name": "Sura Tour",
    "description": "Sura Tours, is a responsive travel website, utilizing React and SCSS. Designed and implemented sections encompassing banner, about, features, popular tours booking, client feedback, and contact. Proficiently integrated interactive elements while ensuring seamless UI/UX. Demonstrated adeptness in front-end development, user-centric design, and responsive web design principles.",
    "details": [
      {
        "step": "Sura Tours is a responsive travel website, utilizing React and SCSS."
      },
      {
        "step": "Proficiently integrated interactive elements while ensuring seamless UI/UX."
      },
      {
        "step": "In this project I use React-router for Routing. And I also use dynamic routing. I create a dashboard with nested-route."
      },
      {
        "step": "Also use react-toastify for toast, use axios for fetching data server side to client side and client side to server side, use heroku for hosting server side."
      },
      {
        "step": "I use stripe to make payment method. I have added the method of pay with Master Card, Debit Card, Transaction id etc."
      }
    ],
    "githubClient": "https://github.com/KamrujjamanRony/sura-tours",
    "link": "https://sura-tour.netlify.app/",
    "tools": ["React", "SASS", "React Router", "Node.js"]
  },
  {
    "id": 4,
    "img": "https://i.ibb.co/3BjvvD1/sura-0.png",
    "img1": "https://i.ibb.co/G7F2Qc1/sura-1.png",
    "img2": "https://i.ibb.co/brFPwN1/sura-2.png",
    "img3": "https://i.ibb.co/Q96Xgwg/sura-3.png",
    "name": "Sura Tools",
    "description": "Sura Tools website is a parts or tools of many kind of products based website. It's a kind of shop management system. Here user can sign in freely with user email account and can create their own profile. User can see all product's details, User also know about the new arrival products, can order the products as their needs, also can cancel their order and can payment as of their desired orders. User can see inventory items and new arrival items. Also user will see the company policy, services, new arrivals products's offers, company features, Testimonials of the Clients reviews, clients can add their review, and the Business summary of ToolKits Ltd. On the other hand, Admin panel can also Visit and update their profile. Admin will see all the orders, they can manage the orders, and they can also make someone a admin.",
    "details": [
      {
        "step": "For UI design, I use React-router-dom, Tailwind CSS, Daisy UI, Vanilla CSS, Daisy UI icons."
      },
      {
        "step": "For authentication, password rest and email verified I use Firebase authentication and React-firebase-hooks. Also use react-firebase-hooks for get logged in users information such as display name, email etc. I also use Firebase hosting for client side hosting. I also use React-form and html form."
      },
      {
        "step": "In this project I use React-router for Routing. And I also use dynamic routing. I create a dashboard with nested-route."
      },
      {
        "step": "Also use react-toastify for toast, use axios for fetching data server side to client side and client side to server side, use heroku for hosting server side."
      },
      {
        "step": "I use stripe to make payment method. I have added the method of pay with Master Card, Debit Card, Transaction id etc."
      }
    ],
    "githubClient": "https://github.com/KamrujjamanRony/sura-tools-clientside",
    "githubServer": "https://github.com/KamrujjamanRony/sura-tools-serverside",
    "link": "https://sura-tools.web.app/",
    "tools": [
      "React",
      "TailwindCSS",
      "DaisyUI",
      "React Router",
      "Firebase",
      "React Firebase Hooks",
      "Node.js",
      "MongoDB",
      "Express",
      "React toastify",
      "Stripe",
      "JWT token"
    ]
  },
  {
    "id": 5,
    "img": "https://i.ibb.co/K6pRqbc/street-0.png",
    "img1": "https://i.ibb.co/qYfj6Cv/street-1.png",
    "img2": "https://i.ibb.co/mvzTCpD/street-2.png",
    "img3": "https://i.ibb.co/1XMjD4g/street-3.png",
    "name": "Street Smartz",
    "description": "Street Smartz website is a inventory management base website. Here user can sign in freely with user email account. User can see inventory items and new arrival items. Also user can add new inventory item that can show in inventory items section. Also user can manage those inventory items on manage inventory page.Such as delivery items and restock items. Here also an extra Manage Inventories button that can take users to the manage inventory page. In this manage inventory page user can show all inventory items with delete button. Here user can delete any inventory items. There are also my items route that the logged-in user can see only his/her added items. Here also user can delete his/her inventory items.",
    "details": [
      {
        "step": "---For UI design, i use react-bootstrap, bootstrap 5 and vanilla CSS and react-fontawesome. Here user stock electronic items, delivered items, add new item and manage those items."
      },
      {
        "step": "For authentication, password rest and email verified i use firebase authentication and react-firebase-hooks. Also use react-firebase-hooks for get logged in users information such as display name, email etc. i also use firebase hosting for client side hosting."
      },
      {
        "step": "In this project i use react-router for routing. And I also use dynamic routing."
      },
      {
        "step": "Also use react-toastify for toast, use axios for fetching data server side to client side and client side to server side, use heroku for hosting server side."
      },
      {
        "step": "I use mongoDB for store data in server side. Here i create some api for store inventory items detail, add new inventory item, update items quantity, store user email, delete inventory item, load all inventory items in client side."
      }
    ],
    "githubClient": "https://github.com/KamrujjamanRony/street-smartz-client",
    "githubServer": "https://github.com/KamrujjamanRony/street-smartz-server",
    "link": "https://street-smartz.web.app/",
    "tools": [
      "React",
      "React Bootstrap",
      "React Firebase Hooks",
      "React Router",
      "Firebase",
      "Node.js",
      "MongoDB",
      "Express",
      "React toastify",
      "JWT token"
    ]
  },
  {
    "id": 6,
    "img": "https://i.ibb.co/7X0KVXh/toolkits.jpg",
    "img1": "https://i.ibb.co/khn2vsy/toolkits-1.png",
    "img2": "https://i.ibb.co/qMsPXqF/toolkits-2.png",
    "img3": "https://i.ibb.co/P6QRMNc/toolkits-3.png",
    "name": "ToolKits",
    "description": "ToolKits website is a parts or tools of many kind of products based website. It's a kind of shop management system. Here user can sign in freely with user email account and can create their own profile. User can see all product's details, User also know about the new arrival products, can order the products as their needs, also can cancel their order and can payment as of their desired orders. User can see inventory items and new arrival items. Also user will see the company policy, services, new arrivals products's offers, company features, Testimonials of the Clients reviews, clients can add their review, and the Business summary of ToolKits Ltd. On the other hand, Admin panel can also Visit and update their profile. Admin will see all the orders, they can manage the orders, and they can also make someone a admin.",
    "details": [
      {
        "step": "For UI design, I use React-router-dom, Tailwind CSS, Daisy UI, Vanilla CSS, Daisy UI icons."
      },
      {
        "step": "For authentication, password rest and email verified I use Firebase authentication and React-firebase-hooks. Also use react-firebase-hooks for get logged in users information such as display name, email etc. I also use Firebase hosting for client side hosting. I also use React-form and html form."
      },
      {
        "step": "In this project I use React-router for Routing. And I also use dynamic routing. I create a dashboard with nested-route."
      },
      {
        "step": "Also use react-toastify for toast, use axios for fetching data server side to client side and client side to server side, use heroku for hosting server side."
      },
      {
        "step": "I use stripe to make payment method. I have added the method of pay with Master Card, Debit Card, Transaction id etc."
      }
    ],
    "githubClient": "https://github.com/KamrujjamanRony/toolkits-client",
    "githubServer": "https://github.com/KamrujjamanRony/toolkits-server",
    "link": " https://toolkits-c33e4.web.app/",
    "tools": [
      "React",
      "TailwindCSS",
      "DaisyUI",
      "React Router",
      "Firebase",
      "React Firebase Hooks",
      "Node.js",
      "MongoDB",
      "Express",
      "React toastify",
      "Stripe",
      "JWT token"
    ]
  }
]
